 ![png](Data

In [2]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'root' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/Chinook'
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/Chinook)

In [3]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

   Tables_in_chinook
0              album
1             artist
2           customer
3           employee
4              genre
5            invoice
6        invoiceline
7          mediatype
8           playlist
9      playlisttrack
10             track

# What is the most a customer has spent on a single purchase and what is their customerId?

In [9]:
q = '''SELECT customerId, Total from Invoice'''

pd.read_sql(q,engine)

     customerId  Total
0             2   1.98
1             4   3.96
2             8   5.94
3            14   8.91
4            23  13.86
..          ...    ...
407          25   3.96
408          29   5.94
409          35   8.91
410          44  13.86
411          58   1.99

[412 rows x 2 columns]